//======================================================= Presets Groups    ================================
Group group[] PROGMEM = {
  771, "Austin TX",      //
  772, "Clearlake CA",   //
// 773, "G3",            //
// 774, "G4",            //
// 775, "G5",            //
// 776, "G6",            //
// 777, "G7",            //
// 778, "G8",            //
//
//
//
};
//======================================================= END Presets Groups     ===========================

//======================================================= Memory     =======================================
Memory memory[] PROGMEM = {

// FM Radio Station presets //

  88.1,   "KNLE",     "771",  // 
  88.5,   "KHIB",     "771",  // 
  88.7,   "KAZI",     "771",  // 
  89.5,   "KMFA",     "771",  // 
  89.9,   "KTSW",     "771",  // 
  90.5,   "KUT",      "771",  // 
  91.3,   "KNCT",     "771",  // 
  91.7,   "KVRX",     "771",  // 
  91.9,   "KLLR",     "771",  // 
  92.1,   "K221GC",   "771",  // 
  92.3,   "KIIZ",     "771",  // 
  92.5,   "KVLR",     "771",  // 
  93.3,   "KGSR",     "771",  // 
  93.7,   "KLBJ",     "771",  // 
  94.1,   "KXPE-LP",  "771",  // 
  94.3,   "KCDR-LP",  "771",  // 
  94.7,   "KAMX",     "771",  // 
  95.5,   "KKMJ",     "771",  // 
  96.3,   "KGID",     "771",  // 
  96.7,   "KHFI",     "771",  // 
  97.1,   "K246BD",   "771",  // 
  98.1,   "KVET",     "771",  // 
  98.5,   "KRXT",     "771",  // 
  98.9,   "KUTX",     "771",  // 
  99.3,   "KOKE",     "771",  // 
  99.7,   "K259AJ",   "771",  // 
  100.7,  "KASE",     "771",  // 
  101.5,  "KROX",     "771",  // 
  101.9,  "KJZX-LP",  "771",  // 
  102.3,  "KPEZ",     "771",  // 
  102.7,  "K274AX",   "771",  // 
  103.1,  "K276EL",   "771",  // 
  103.5,  "KBPA",     "771",  // 
  103.9,  "KBEY",     "771",  // 
  104.3,  "KLQB",     "771",  // 
  104.7,  "KHSB",     "771",  // 
  104.9,  "KTXX",     "771",  // 
  105.1,  "KMIL",     "771",  // 
  105.5,  "KUSJ",     "771",  // 
  105.9,  "KFMK",     "771",  // 
  106.3,  "KOOC",     "771",  // 
  106.5,  "KAJZ",     "771",  // 
  106.7,  "KGTN-LP",  "771",  // 
  106.9,  "KOOV",     "771",  // 
  107.1,  "KLZT",     "771",  // 
  107.3,  "KLFX",     "771",  // 
  107.7,  "KLJA",     "771",  // 
  
  
  88.1,   "KWTF",     "772",  // 
  88.5,   "KPFZ",     "772",  // 
  88.7,   "KORB",     "772",  // 
  89.1,   "KBBF",     "772",  // 
  89.5,   "KPRA",     "772",  // 
  89.9,   "KOSC",     "772",  // 
  91.1,   "KRCG",     "772",  // 
  91.3,   "KSVY",     "772",  // 
  91.5,   "KZYZ",     "772",  // 
  91.9,   "KLVR",     "772",  // 
  92.9,   "KFGY",     "772",  // 
  93.5,   "KMKX",     "772",  // 
  93.7,   "KBBL",     "772",  // 
  94.5,   "KWNE",     "772",  // 
  95.3,   "KUIC",     "772",  // 
  95.9,   "KRSH",     "772",  // 
  96.7,   "KNOB",     "772",  // 
  97.1,   "KULV",     "772",  // 
  97.7,   "KVRV",     "772",  //
  97.9,   "KLMG",     "772",  // 
  98.3,   "KXBX",     "772",  // 
  98.7,   "KXTS",     "772",  // 
  99.1,   "KARA",     "772",  // 
  99.5,   "KNTI",     "772",  // 
  99.9,   "KRCX",     "772",  // 
  100.1,  "KZXT",     "772",  // 
  100.3,  "KMOB-LP",  "772",  // 
  100.5,  "KTDE",     "772",  // 
  100.9,  "KSXY",     "772",  // 
  101.7,  "KHTH",     "772",  // 
  102.3,  "KYOE",     "772",  // 
  102.5,  "KSFM",     "772",  // 
  102.7,  "KWVF",     "772",  // 
  103.1,  "KKCY",     "772",  // 
  103.3,  "KUKI",     "772",  // 
  104.1,  "KJOR",     "772",  // 
  104.3,  "KXSE",     "772",  // 
  104.9,  "KRCB",     "772",  // 
  105.5,  "KSAC",     "772",  // 
  105.9,  "KQPM",     "772",  // 
  106.3,  "KPQW",     "772",  // 
  107.1,  "KSRT",     "772",  // 
  107.5,  "KZSZ",     "772",  // 
  
  
// AM Radio Station presets //

  590,  "KLBJ",       "771",  //
  970,  "KIXL",       "771",  //
  1050, "KRMY",       "771",  //
  1060, "KFIT",       "771",  //
  1120, "KTXW",       "771",  //
  1260, "KTAE",       "771",  //
  1300, "KVET",       "771",  //
  1330, "KTON",       "771",  //
  1370, "KJCE",       "771",  //
  1400, "KTEM",       "771",  //
  1420, "KGNB",       "771",  //
  1440, "KELG",       "771",  //
  1450, "KCYL",       "771",  //
  1490, "KTSN",       "771",  //
  1530, "KZNX",       "771",  //
  1560, "KTXZ",       "771",  //
  1570, "KVLG",       "771",  //
  1580, "KWED",       "771",  //
  1600, "KWED",       "771",  //
  
  
  740,  "KCBS",       "772",  //
  890,  "KVMX",       "772",  //
  1190, "KDYA",       "772",  //
  1250, "KLLK",       "772",  // 
  1270, "KXBX",       "772",  //
  1320, "KIFM",       "772",  //
  1350, "KSRO",       "772",  //
  1380, "KTKZ",       "772",  //
  1400, "KUKI",       "772",  //
  1410, "KMYC",       "772",  //
  1440, "KVON",       "772",  //
  1450, "KOBO",       "772",  //
  1460, "KRRS",       "772",  //
  1490, "KZNB",       "772",  //
  1530, "KFBK",       "772",  //
  1560, "KIQS",       "772",  //
  1600, "KUBA",       "772",  //
  1690, "KFSG",       "772",  //
  

// long wave band presets 153Khz to 279Khz //

// long wave Radio Station presets //
  153,  "Radio Antena Sate",   "ALL",  //
  164,  "MNB Radio 1",         "ALL",  //
  171,  "MAROCCO Medi 1",      "ALL",  //
  198,  "BBC Radio 4",         "ALL",  //
  207,  "Deutschland Radio",   "ALL",  //
  209,  "MNB Radio 1",         "ALL",  //
  225,  "POLONIA Radio",       "ALL",  //
  234,  "RTL Luxenbourg",      "ALL",  //
  243,  "DR Langbølge",        "ALL",  //
  252,  "ALGERIA Chaine 3",    "ALL",  //


// Short wave band presets //

// SW1 - 1800Khz to 5060Khz //
  2500,  "WWV NIST clock",	"ALL", //
  4840,  "WWRC Nashville",	"ALL", //
  5000,  "WWV NIST clock",	"ALL", //
  5025,  "R.REBELDE",   	"ALL", //
  5040,  "R.HABANA CUBA",   "ALL", //
  
 
// SW2 -  5300Khz to 7598Khz //
  5930, "World Music Radio",	"ALL", //
  6950, "Alt Universe Top 40",	"ALL", //
  7305, "Vatican Radio",		"ALL", //
  7360, "Vatican Radio",		"ALL", //
  7470, "Radio Free Asia",		"ALL", //
  7520, "Radio Free Asia",		"ALL", //

  
// SW3 - 9406Khz to 12159Khz //
  9455, "WRMI",	            	"ALL", //
  9595, "Vatican Radio",		"ALL", //
  9670, "Alt Universe Top 40",	"ALL", //
  9770, "Voice of Turkey",	    "ALL", //
  9790, "China Radio Int.",	    "ALL", //
  9850, "R.ROMANIA INT.",		"ALL", //
  9930, "Radio Free Asia",		"ALL", //
  9975, "Voice of Hope",		"ALL", //
  10000, "WWV NIST clock",		"ALL", //
  11655, "Voice of America",	"ALL", //
  
// SW4 - 13576Khz to 18166Khz //
  15000, "WWV NIST clock",	"ALL", //
  15700, "World Music Radio",	"ALL", //
  17775, "Voice of Hope",	"ALL", //
  
// SW5 - 18904Khz to 26097Khz //
  20000, "WWV NIST clock",	"ALL", //
  25000, "WWV NIST clock",	"ALL", //
  28000, "World Music Radio",	"ALL", //
  
// VHF band presets 64.08Mhz to 86.99Mhz //


//  
//
//  
};
//======================================================= END Memory     ===================================